backend/views/content/_form.php

    <?php $form = ActiveForm::begin(); ?>

<!--    --><?//= $form->field($model, 'catid')->textInput() ?>
    <?= $form->field($model,'catid')->dropDownList(ArrayHelper::map(ContentCatlog::find()->asArray()->all(),'catid', 'catname'));?>
---
SELECT * FROM `co_content_catlog`