backend/controllers/ContentController.php

    protected function findModel($id)
    {
        if (($model = Content::findOne($id)) !== null) {
---
SELECT * FROM `co_content` WHERE `id`='1048'