backend/controllers/NavController.php

    protected function findModel($id)
    {
        if (($model = Nav::findOne($id)) !== null) {
---
SELECT * FROM `co_nav` WHERE `id`='4'