frontend/controllers/api/GoodsController.php

    protected function _view($params)
    {
        $id = $params['id'] ? intval($params['id']) : null;
        if (is_null($id))
        {
            return self::setReturn('0002', 'failed', '', '缺少商品ID');
        }
        else if (($findModel = Goods::findOne($id)) !== null)
---
SELECT * FROM `co_goods` WHERE `goods_id`=67

    protected function getGoodsData($findModel)
    {
        $goodsTables = Goods::tableName();
        $query = Goods::find()->where([$goodsTables.'.goods_id'=>$findModel->goods_id]);
        $query->joinWith(['goodsAttr']);
        $query = Goods::leftJoinByQueryType($query, $findModel->type);

        return $query->asArray(true)->one();
---
SELECT * FROM `co_goods_attr` WHERE `goods_id`='67'
SELECT `co_goods`.* FROM `co_goods` LEFT JOIN `co_goods_attr` ON `co_goods`.`goods_id` = `co_goods_attr`.`goods_id` INNER JOIN `co_course` `b` ON `co_goods`.`association_id` = `b`.`course_id` WHERE `co_goods`.`goods_id`=67