frontend/controllers/api/LiveController.php

    public function actionMylive(){
        $mylive = new MyLive();
        $liveinfo = $mylive::find()
            ->where("userid = ".Yii::$app->user->id." and status >= 1")
            ->asArray()
            ->all();
---
SELECT * FROM `co_mylive` WHERE userid = 34343 and status >= 1