frontend/controllers/api/OrderController.php

    public function actionSubmit()
    {
        $data = json_decode(Yii::$app->request->rawBody, true);
        $model = new Order;
        $model->userid = $data['userid'];
        $model->discount = 0.00;
        $model->price = 0.00;
        $model->status = 'unpay';
        $model->trade_sn = $trade_sn = $this->_create_sn();
        $model->remarks = $data['remarks'];

        if (empty($data['userid'])) {
            $this->setReturn("0003", "failed", "", "参数错误");
            return;
        }

        $username = Member::find()->select(['id', 'username', 'usertype'])->where(['id' => $model->userid])->one();
---
SELECT `id`, `username`, `usertype` FROM `co_member` WHERE `id`=34343

            $model->type = 0;
            $i = 1;
            foreach ($data['goods'] as $key => $value) {
                $good = Goods::find()->where(['goods_id' => $value['id']])->asArray()->one();
---
SELECT * FROM `co_goods` WHERE `goods_id`='56'


                if ($good) {
                    if ($good['type'] == 1) {
                        $hasCourse = Mycourse::find()->where(['userid' => $model->userid, 'courseid' => $good['association_id']])->count();
---
SELECT COUNT(*) FROM `co_mycourse` WHERE (`userid`=34343) AND (`courseid`='257')


        $op = new OrderPay();
        $op->status = 'unpay';
        $op->save();
---
INSERT INTO `co_order_pay` (`status`, `created_at`, `updated_at`) VALUES ('unpay', 1508246114, 1508246114)
INSERT INTO `co_order` (`userid`, `discount`, `price`, `status`, `trade_sn`, `remarks`, `username`, `type`, `payid`, `created_at`, `updated_at`) VALUES (34343, '0', '0', 'unpay', '2017101721151408132', '', 'yeshulin', 0, 180, 1508246114, 1508246114)

    public function actionHascourse()
    {
        $data = json_decode(Yii::$app->request->rawBody, true);

        if (empty($data['userid']) || empty($data['courseid'])) {
            $this->setReturn("0003", "failed", "", "参数错误");
            return;
        }

        $hasCourse = Mycourse::find()->where(['userid'=>$data['userid'],'courseid'=>$data['courseid']])->count();
---
SELECT COUNT(*) FROM `co_mycourse` WHERE (`userid`=34343) AND (`courseid`='257')