common/models/Order.php

SELECT COUNT(*) FROM `co_order` WHERE `userid`=34343
SELECT * FROM `co_order` WHERE `userid`=34343 ORDER BY `created_at` DESC LIMIT 10
SELECT * FROM `co_order_content` WHERE `order_id`=187
---
    public static function arrayAll($where, $page)
    {
        $pagesize = isset($page['pagesize']) ? intval($page['pagesize']) : 10;
        $page = isset($page['page']) ? intval($page['page']) : 1;
        if(!$where['userid']){
            unset($where['userid']);
        }
        if($where['topuserid']){
            $query = self::find()->leftJoin("co_member",'co_order.userid = co_member.id')->where("co_member.top_userid=".$where['topuserid']);
            unset($where['topuserid']);
        }else{
            unset($where['topuserid']);
            $query = self::find()->where($where);
        }


        $totalCount = $query->count();
        $page = $page > 0 ? $page : 1;
        $pagesize = $pagesize > 0 ? $pagesize : 1;
        if ($pagesize > 20) {
            $pagesize = 20;
        }
        $pages = ceil($totalCount / $pagesize);
        if ($age > $pages) {
            $page = $pages;
        }

        $arrayReust = null;
        $result = $query->offset(($page - 1) * $pagesize)->orderBy(['created_at' => SORT_DESC])->limit($pagesize)->all();

        if ($result !== null) {
            foreach ($result as $key => $value) {
                $orderContents = $value->orderContents;