backend/views/site/main.php

SELECT COUNT(*) FROM `co_member` WHERE `status`=10
SELECT COUNT(*) FROM `co_member` WHERE (`status`=10) AND (`created_at` BETWEEN 1506787200 AND 1509465599)
SELECT COUNT(*) FROM `co_member` WHERE (`status`=10) AND (`created_at` BETWEEN 1506873600 AND 1507478399)
SELECT COUNT(*) FROM `co_member` WHERE (`status`=10) AND (`created_at` BETWEEN 1507651200 AND 1507737599)
SELECT COUNT(*) FROM `co_member` WHERE (`status`=10) AND (`created_at` BETWEEN 1507737600 AND 1507823999)
---
                </div>
                <div class="ibox-content" style="height: 148px;">
                    <p>总注册用户数<font
                            color="red"><?= Member::find()->where(['status' => Member::STATUS_ACTIVE])->count() ?></font>人，
                        上月注册<font
                            color="red"><?= Member::find()->where(['status' => Member::STATUS_ACTIVE])->andWhere(['BETWEEN', 'created_at', $beginThismonth, $endThismonth])->count() ?></font>人，
                        上周注册<font
                            color="red"><?= Member::find()->where(['status' => Member::STATUS_ACTIVE])->andWhere(['BETWEEN', 'created_at', $beginLastweek, $endLastweek])->count() ?></font>人，
                        昨日注册<font
                            color="red"><?= Member::find()->where(['status' => Member::STATUS_ACTIVE])->andWhere(['BETWEEN', 'created_at', $beginYesterday, $endYesterday])->count() ?></font>人，
                        今日注册<font
                            color="red"><?= Member::find()->where(['status' => Member::STATUS_ACTIVE])->andWhere(['BETWEEN', 'created_at', $beginToday, $endToday])->count() ?></font>人。