frontend/modules/site/controllers/NewsController.php

    public function actionList(){
        $catid = yii::$app->request->get('catid');
        $model = ContentCatlog::findOne($catid);
---
SELECT * FROM `co_content_catlog` WHERE `catid`='6'