backend/models/Nav.php

    public static function getNavList($parent = 0, $NavsList = [''=>'一级导航'], $ri = 0){
        $ri ++;
        if ($parent == 0) {
            $where = 'parent is null';
        }
        else {
            $where = ['parent'=> $parent];
        }
        $Navs = self::find()->where($where)->orderBy(['order'=>SORT_DESC])->all();
        foreach ($Navs as $v) {
            $NavsList[$v['id']] = '├'.str_repeat('-', $ri*5) .$v['name'];
            if (self::find()->where(['parent'=>$v['id']])->one() !== null) {
---
SELECT * FROM `co_nav` WHERE parent is null ORDER BY `order` DESC
SELECT * FROM `co_nav` WHERE `parent`=3