frontend/models/Goods.php

SELECT * FROM `co_course_config_id` WHERE (`course_config_id`='48') AND (`type`=2)
---
    public function courseQuery($query, $params)
    {
        if (isset($params['config']) && !empty($params['config']))
        {
            $type = CourseConfig::TYPE_COURSE;
            if (isset($params['index']))
            {
                $type = CourseConfig::TYPE_INDEX;
            }
            $config = explode(',', $params['config']);
            $CourseConfigModel = CourseConfigId::findAll(['course_config_id'=>$config[0], 'type'=>$type]);